html/meeting-notes/2012-05-01.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-05-01</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-05-01"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-13 12:05:16 PDT"/>
<meta name="author" content="Matthew Croop"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-05-01</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Setup</a></li>
<li><a href="#sec-2">Experiments and Fractals</a></li>
<li><a href="#sec-3">Macros</a></li>
<li><a href="#sec-4">Timekeeping</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Setup</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Rafe renames the Moore Business Office the "Department of Money
    and Verisimilitude."
</li>
<li>Levine 307 is already occupied by grading-people.
<ul>
<li><b>TAs</b>: Don't mind us, we're just sitting in the corner.
</li>
<li><b>Andrew</b>: Using vim.
</li>
</ul>

</li>
<li><b>Rafe</b>: Vermin Supreme is running for president.
</li>
<li>Rafe drops food.
<ul>
<li><b>Rafe</b>: You didn't see that.
</li>
</ul>

</li>
<li>Which package manager is best?
<ul>
<li>ELPA is for hardcore Lisp hackers.
</li>
<li><b>Mish</b>: The Ruby kids post to Marmalade.
</li>
<li><b>John</b>: So ELPA.
</li>
</ul>

</li>
<li><b>Mish</b>: Did you get the dongle working?
<ul>
<li><b>Rafe</b>: I don't have a dongle. I am dongleless.
</li>
</ul>

</li>
<li>Andrew recites the <a href="http://ifaq.wap.org/computers/abcsofunix.html">ABCs of Unix</a>.
<ul>
<li><b>Mish</b>: You should tweet that.
</li>
<li><b>Andrew</b>: It's way more than 140 characters.
</li>
<li><b>Mish</b>: No, the link.
</li>
<li><b>Andrew</b>: It came up as a fortune.
</li>
</ul>

</li>
<li><b>John</b>: Does anyone want to develop Mimecraft with me?
<ul>
<li>John mimes exploring.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Experiments and Fractals</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Adam Aviv arrives, bearing donuts and <i>[embargoed until after     publication of Adam's paper - ed.]</i>, to hijack our
    meeting. He wants test subjects for his research.
<ul>
<li><b>Andrew</b>: What are we doing?
</li>
<li>Specifically, what do we have to do to get donuts?
</li>
<li><b>Adam</b>: You'll be <i>[embargoed]</i> a large number of times.
</li>
</ul>

</li>
<li>Adam tells John his user number. John now needs to keep track of it.
<ul>
<li><b>John</b>: I'll open up an org file.
</li>
<li><b>Adam</b>: No, just remember it.
</li>
</ul>

</li>
<li>You have to use your dominant hand for the experiment. It
    doesn't matter what hand you use for the donut-eating.
</li>
<li>Meanwhile, we also <a href="http://www.youtube.com/watch?v=foxD6ZQlnlU">zoom in</a> on fractals. The video goes on for 10
    minutes.
<ul>
<li><b>Rafe</b>: Error, maximum recursion depth exceeded.
</li>
</ul>

</li>
<li>Adam needs more volunteers.
<ul>
<li><b>Adam</b>: Wasserman! You're next.
</li>
<li><b>Zach</b>: Ok.
</li>
<li><b>John</b>: Zach, you're never going to beat my high score!
</li>
</ul>

</li>
<li>Rafe proposes Fractal Night in Wu and Chen. It's like DMD Movie
    Night, but with fractals.
</li>
<li>A familiar <i>[embargoed]</i> is a friendly sight.
<ul>
<li><b>Zach</b>: That was my social security number. What's going on here?
</li>
</ul>

</li>
<li>There is much complaining about the <i>[embargoed]</i> keyboard.
</li>
<li>Adam gets a phone call.
<ul>
<li><b>Adam</b>: I'd love to join you for dinner! I'm collecting data
      right now though.
</li>
<li><b>Everyone</b>: It's a date!
</li>
</ul>

</li>
<li><b>Zach</b>: Am I done?
<ul>
<li><b>Adam</b>: Come with me.
</li>
<li><b>Mish</b>: Come with me if you want to live.
</li>
</ul>

</li>
<li>Mish keeps missing the sevens.
<ul>
<li><b>John</b>: PhD defense: Sevens are tough.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Macros</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Everyone <code>M-100</code>'s Rafe's silly <code>asdfasdfdsa</code> macro. Emacs crashes.
<ul>
<li><b>John</b>: Moral of the story, you guys are idiots.
</li>
</ul>

</li>
<li>Rafe picked up the Grand Unified Theory of keyboard macros from a book.
</li>
<li><b>Rafe</b>: <code>C-x C-k C-n</code> and <code>C-x C-k C-p</code> take you forward and
    backward in the macro kill ring, respect.
<ul>
<li>The two shortcuts are given forward respect and backward
      respect, respectively.
</li>
</ul>

</li>
<li>Rafe's macro is straight outta Compton.
</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Timekeeping</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>We watch <a href="http://www.standard-time.com/index2_en.php">the clock</a>.
<ul>
<li><b>Mish</b>: They're moving pretty slow. Broadway musicals do this faster.
</li>
</ul>

</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-13 12:05:16 PDT</p>
<p class="author">Author: Matthew Croop</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
